Revit 2026 API
Selection.PickObjects Method
Prompts the user to select multiple objects.
Overload List
Name | Description
PickObjects(ObjectType) | Prompts the user to select multiple objects.
PickObjects(ObjectType, ISelectionFilter) | Prompts the user to select multiple objects which pass a customer filter.
PickObjects(ObjectType, String) | Prompts the user to select multiple objects while showing a custom status prompt string.
PickObjects(ObjectType, ISelectionFilter, String) | Prompts the user to select multiple objects which pass a custom filter while showing a custom status prompt string.
PickObjects(ObjectType, ISelectionFilter, String, IList<Reference>)
Top
See Also
Reference
Selection Class
Autodesk.Revit.UI.Selection Namespace